training_sentences = {
        1: "التِّلْميذُ مُجْتَهِدٌ",
        2: "تُشْرِقُ الشَّمْسُ صَباحاً",
        3: "تَعيشُ الأَسْماكُ فيِ الْماءِ"
}

primary_test2_sentences = {
    1: "أُحِبُّ حَديقَةَ الْحَيَواناتِ.",
    2: "يَشْرَبُ مُحَمَّدٌ الْماءَ.",
    3: "حَرارَةُ الشَّمْسِ شَديدَةٌ.",
    4: "نَذْهَبُ إِلى الْـبَحْرِ لِصَيْدِ السَّمَكِ.",
    5: "فازَ فَريقُ كُرَةِ الْقَدَمِ بِالْجائِزَةِ الأولى لِلْمَرَّةِ الثّانِيَةِ.",
    6: "بُسْتانُ بَيْتِنا جميلٌ تَمْلَؤُهُ الأَزْهارُ و الأَشْجَارُ.",
    7: "جَمَعَتْ عَبيرُ مَعَ أَفْرادِ الأُسْرَةِ تُفّاحاً كَثيراً مِنْ شَجَرَةِ التُّفّاحِ",
    8: "تُهاجِرُ الْكَثيرُ مِنَ الطُّيورِ إِلى جَزيرَةِ الْعَرَبِ وَ تُقيمُ فيها في فَصْلِ الشِّتاءِ.",
    9: "الْخَيْلُ الْعَرَبِيُّ مِنْ أَجْمَلِ الْحَيَواناتِ، لَهُ رَأْسٌ مُسْتَقيمٌ، وَ صَدْرٌ واسِعٌ، وَ قَوائِمُ رَشيقَةٌ، هُوَ قَوِيٌّ شَهْمٌ، إِنَّهُ أَجْمَلُ جَوادٍ عَلى وَجْهِ الأَرْضِ.",
    10: "اِنْتَظَرَ فَيْصَلٌ بِصُحْبَةِ الرَّجُلِ الْكَفيفِ في الْمَكانِ الْمُخَصَّصِ لِعُبورِ الْمُشاةِ، وَ عِنْدَما تَوّقَّفَتِ السَّيّاراتُ، عَبَرَ فَيْصَلٌ الشّارِعَ مُمْسِكاً بِيَدِ الرَّجُلِ، فَشَكَرَ الرَّجُلُ فَيْصَلاً وَ دَعا لَهُ."
}

