# Test1 data.
TRAINING_WORDS = ['رَكِبَ', 'بَيْتٍ', 'حَمَدٌ']
TEST_WORDS = [
    "أُخْتي", "تَحْتَوي", "هذانِ", "الرَّبيعُ", "الْوَجيزُ",
    "جَمَلٌ", "أَوْصِلْ", "بحَرَكاتِهِ", "التّالِيَةُ", "الدَّوْلَتانِ",
    "الَّذينَ", "التَّعْبيرَ", "أَسْطُرٍ","عَلَيْهِ","الُْمناسَبَةُ",
    "الأَطْعِمَةِ", "اِسْتِخْراجُ", "بِمَواقِعِها", "الثَّلاثَ", "وَأَلْوَانٍ",
    "إِنْشائِكَ", "هؤلاءِ", "الْوَحْدَةِ", "بِالأَرْواحِ","الْفُِقَراءُ",
    "وَالاِسْتيعابَ", "اللُّغَوِيُّ", "اِضْبِطْ", "تُضْنيني", "لِلَّهِ"
]

