TRAINING_WORDSـSEC = ['رَكِبَ', 'بَيْتٍ', 'حَمَدُُ']
TEST_WORDS_secondary_test1 = [
    "الَّذينَ", "يَخْتاروا", "شَيْئًا", "أُولئِكَ", "اِسْتِخْراجُ",
    "عَلَيْهِ", "الْفُقَراءُ", "الثَّلاثَ", "بِالأَرْواحِ", "التَّعْبيرَ",
    "هؤلاءِ", "مُتَجانِسًا", "بِاسْتِطاعَتِهِ", "إِنْشائِكَ", "حَوائِجَهُمْ",
    "بِمَواقِعِها", "أَسْطُرِ", "الْأَطْعِمَةِ", "مُؤَسِّسينَ", "غِذائِيَّةُُ",
    "اِضْبِطْ", "تُضْنيني", "مُؤازَرَةُُ", "يُرْتَجى", "الْمُناسَبَةُ",
    "تَباطُؤْ", "عامَلوني", "بِهَوائِهِ", "وَأَلْوانٍ", "لِلهِ",
    "اِصْطَدَمَ", "الْاِصْطِناعِيَّةُ", "وَالْاِسْتيعابَ", "التِّسْعينِيّاتْ", "اِنْتَظَرْتُكَ",
    "الْكَفاءاتِ", "فَتًى", "ٱللُّغَوِيُّ", "الْوَحْدَةِ", "مُتَلَأْلِئَةً"
]

