

secondary_test2_training_questions = [
    {
        "text": "خَرَجَ مُحَمّدُُ لِيَلْعَبَ مَعَ ..........",
        "options": [
            {"label": "أ", "text": "السّيّاراتِ", "value": "أ"},
            {"label": "ب", "text": "رِفاقِهِ", "value": "ب"},
            {"label": "ج", "text": "الشّمْسِ", "value": "ج"},
            {"label": "د", "text": "الْكُرَةِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "الطّائِرةُ تَطيرُ في  ..........",
        "options": [
            {"label": "أ", "text": "الْبَحْرِ", "value": "أ"},
            {"label": "ب", "text": "الْبَرّ", "value": "ب"},
            {"label": "ج", "text": "الْجَوّ", "value": "ج"},
            {"label": "د", "text": "التّرابِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "أَغْسِلُ أَسْناني بِ   ..........",
        "options": [
            {"label": "أ", "text": "الْقَلَمِ", "value": "أ"},
            {"label": "ب", "text": "الْفُرْشاةِ", "value": "ب"},
            {"label": "ج", "text": "الْمِلْعَقَةِ", "value": "ج"},
            {"label": "د", "text": "الْمَنْديلِ", "value": "د"},
        ],
        "correct": "ب"
    },
]

main_questions = [
    {   
        "id": 1,
        "text": "أَيّامُ الْأُسْبوعِ ..........",
        "options": [
            {"label": "أ", "text": "عَشَرَةُُ", "value": "أ"},
            {"label": "ب", "text": "سَبْعَةُُ", "value": "ب"},
            {"label": "ج", "text": "ثَمانِيَةُُ", "value": "ج"},
            {"label": "د", "text": "خَمْسَةُُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "id": 2,
        "text": "نَعْرِفُ الْوَقْتَ بِـ ..........",
        "options": [
            {"label": "أ", "text": "الْقَمَرِ", "value": "أ"},
            {"label": "ب", "text": "الْكَوْكَبِ", "value": "ب"},
            {"label": "ج", "text": "السّاعَةِ", "value": "ج"},
            {"label": "د", "text": "النّوْمِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "id": 3,
        "text": "نَقْرأُ .......... في مَكْتَبَةِ الْمَدْرَسَةِ.",
        "options": [
            {"label": "أ", "text": "صورَةً", "value": "أ"},
            {"label": "ب", "text": "فاتورَةً", "value": "ب"},
            {"label": "ج", "text": "وَصْفَةً طِبّيّةً", "value": "ج"},
            {"label": "د", "text": "قِصّةً", "value": "د"},
        ],
        "correct": "د"
    },



    {
        "id": 4,
        "text": "الْأَرْنَبُ يَأْكُلُ ..........",
        "options": [
            {"label": "أ", "text": "الدّجاجَ", "value": "أ"},
            {"label": "ب", "text": "الْقِطّةَ", "value": "ب"},
            {"label": "ج", "text": "الْفَأْرَ", "value": "ج"},
            {"label": "د", "text": "الْجَزَرَ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "id": 5,
        "text": "........... يَزْرَعُ الْأَرْضَ.",
        "options": [
            {"label": "أ", "text": "الْفَلّاحُ", "value": "أ"},
            {"label": "ب", "text": "النّجّارُ", "value": "ب"},
            {"label": "ج", "text": "الطّبيبُ", "value": "ج"},
            {"label": "د", "text": "الْجُنْديّ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "id": 6,
        "text": "يُعالِجُ .......... الْمَرْضى.",
        "options": [
            {"label": "أ", "text": "الشّرْطيّ", "value": "أ"},
            {"label": "ب", "text": "الْمُعَلّمُ", "value": "ب"},
            {"label": "ج", "text": "الْمُزارِعُ", "value": "ج"},
            {"label": "د", "text": "الطّبيبُ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "id": 7,
        "text": ".......... تُرضِعُ صِغارَها. ",
        "options": [
            {"label": "أ", "text": "السّمَكَةُ", "value": "أ"},
            {"label": "ب", "text": "الدّجاجَةُ", "value": "ب"},
            {"label": "ج", "text": "الذّبابَةُ", "value": "ج"},
            {"label": "د", "text": "الْقِطّةُ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "id": 8,
        "text": "يَشْرَحُ الْمُعَلّمُ ..........",
        "options": [
            {"label": "أ", "text": "الدّرْسَ", "value": "أ"},
            {"label": "ب", "text": "السّبّورَةَ", "value": "ب"},
            {"label": "ج", "text": "الْقَلَمَ", "value": "ج"},
            {"label": "د", "text": "الصّفّ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "id": 9,
        "text": "أَخو أَبي هُوَ ..........",
        "options": [
            {"label": "أ", "text": "خالي", "value": "أ"},
            {"label": "ب", "text": "جَدّي", "value": "ب"},
            {"label": "ج", "text": "عَمّي", "value": "ج"},
            {"label": "د", "text": "أَخي", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "id": 10,
        "text": "........... يَعيشُ في الْماءِ.",
        "options": [
            {"label": "أ", "text": "السّمَكُ", "value": "أ"},
            {"label": "ب", "text": "الْفيلُ", "value": "ب"},
            {"label": "ج", "text": "الْجَمَلُ", "value": "ج"},
            {"label": "د", "text": "الْعُصْفورُ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "id": 11,
        "text": "يَسْقُطُ .......... في الشّتاءِ.",
        "options": [
            {"label": "أ", "text": "الْحَرّ", "value": "أ"},
            {"label": "ب", "text": "الرّيحُ", "value": "ب"},
            {"label": "ج", "text": "الْعاصِفَةُ", "value": "ج"},
            {"label": "د", "text": "الْمَطَرُ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "id": 12,
        "text": "الشّمْسُ .......... كُلّ صَباحٍ.",
        "options": [
            {"label": "أ", "text": "تَغْرُبُ", "value": "أ"},
            {"label": "ب", "text": "تُشْرِقُ", "value": "ب"},
            {"label": "ج", "text": "تَعْصِفُ", "value": "ج"},
            {"label": "د", "text": "تُمْطِرُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "تَحْصُلُ على الصُّوفِ مِنْ ..........",
        "options": [
            {"label": "أ", "text": "الحِصانِ", "value": "أ"},
            {"label": "ب", "text": "البَقَرِ", "value": "ب"},
            {"label": "ج", "text": "الخَروفِ", "value": "ج"},
            {"label": "د", "text": "النَّمِرِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "يَلِدُ الأَطْفالَ هُوَ ..........",
        "options": [
            {"label": "أ", "text": "القِبْطيسُ", "value": "أ"},
            {"label": "ب", "text": "الحَديقَةُ", "value": "ب"},
            {"label": "ج", "text": "المُسْتَشْفى", "value": "ج"},
            {"label": "د", "text": "الطائِرَةُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "يُخافُ مِنَ القِطِّ ..........",
        "options": [
            {"label": "أ", "text": "الأَسَدُ", "value": "أ"},
            {"label": "ب", "text": "الفَأْرُ", "value": "ب"},
            {"label": "ج", "text": "الخُبْزُ", "value": "ج"},
            {"label": "د", "text": "الطِّفْلُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "........... حَيَوانٌ ضَخْمٌ.",
        "options": [
            {"label": "أ", "text": "الطِّفْلُ", "value": "أ"},
            {"label": "ب", "text": "الفِيلُ", "value": "ب"},
            {"label": "ج", "text": "الكَتِبُ", "value": "ج"},
            {"label": "د", "text": "القِطُّ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "........... حَيَوانٌ مُفْتَرِسٌ.",
        "options": [
            {"label": "أ", "text": "الأَسَدُ", "value": "أ"},
            {"label": "ب", "text": "الفِيلُ", "value": "ب"},
            {"label": "ج", "text": "الأَرْنَبُ", "value": "ج"},
            {"label": "د", "text": "الخُروفُ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "الخَضْرَةُ لَوْنُهُ ..........",
        "options": [
            {"label": "أ", "text": "أَصْفَرُ", "value": "أ"},
            {"label": "ب", "text": "أَبْيَضُ", "value": "ب"},
            {"label": "ج", "text": "رَمادِيُّ", "value": "ج"},
            {"label": "د", "text": "أَزْرَقُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "............. صِفَةٌ سَيِّئَةٌ.",
        "options": [
            {"label": "أ", "text": "الطَّمَاعَةُ", "value": "أ"},
            {"label": "ب", "text": "الكَرَمُ", "value": "ب"},
            {"label": "ج", "text": "الكَتِبُ", "value": "ج"},
            {"label": "د", "text": "الفَضْلُ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "نَشْرِبُ الحَلِيبَ .............",
        "options": [
            {"label": "أ", "text": "الحُلْوِبِ", "value": "أ"},
            {"label": "ب", "text": "الحَلِيبُ", "value": "ب"},
            {"label": "ج", "text": "البَقَرِ", "value": "ج"},
            {"label": "د", "text": "الخُرُوفِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "يُشَكِّلُ ............. يَصْنَعُ الكَرَاسِي.",
        "options": [
            {"label": "أ", "text": "البَائِعُ", "value": "أ"},
            {"label": "ب", "text": "الخَطِيبُ", "value": "ب"},
            {"label": "ج", "text": "النَّجَّارُ", "value": "ج"},
            {"label": "د", "text": "المُحَامِي", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "............. يُدَافِعُ مِنْ أَجْلِ الحَقِّ.",
        "options": [
            {"label": "أ", "text": "المُدَرِّبُ", "value": "أ"},
            {"label": "ب", "text": "القَاضِي", "value": "ب"},
            {"label": "ج", "text": "الفَنَّانُ", "value": "ج"},
            {"label": "د", "text": "العَظِيمُ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "شَهْرُ الصِّيَامِ .............",
        "options": [
            {"label": "أ", "text": "رَجَبٌ", "value": "أ"},
            {"label": "ب", "text": "شَوَّالٌ", "value": "ب"},
            {"label": "ج", "text": "شَعْبَانُ", "value": "ج"},
            {"label": "د", "text": "رَمَضَانُ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "تَرَى النُّجُومَ فِي .............",
        "options": [
            {"label": "أ", "text": "الظُّهْرِ", "value": "أ"},
            {"label": "ب", "text": "اللَّيْلِ", "value": "ب"},
            {"label": "ج", "text": "الصُّبْحِ", "value": "ج"},
            {"label": "د", "text": "العَصْرِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "يَتَكَوَّنُ ............. مِن اثْنَي عَشَرَ شَهْرًا.",
        "options": [
            {"label": "أ", "text": "العَامُ", "value": "أ"},
            {"label": "ب", "text": "اليَوْمُ", "value": "ب"},
            {"label": "ج", "text": "الفَصْلُ", "value": "ج"},
            {"label": "د", "text": "الأُسْبُوعُ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "تُسْتَخْرَجُ الأَدْوِيَةُ مِن .............",
        "options": [
            {"label": "أ", "text": "الحَلِيبِ", "value": "أ"},
            {"label": "ب", "text": "المَخْبَزِ", "value": "ب"},
            {"label": "ج", "text": "النَّبَاتَاتِ", "value": "ج"},
            {"label": "د", "text": "الصَّفِيحَةِ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "نَرْكَبُ ............. لِلانْتِقَالِ مِن مَكَانٍ إِلَى آخَرَ.",
        "options": [
            {"label": "أ", "text": "الكُرْسِيِّ", "value": "أ"},
            {"label": "ب", "text": "السَّيَّارَةِ", "value": "ب"},
            {"label": "ج", "text": "المَسَاحَةِ", "value": "ج"},
            {"label": "د", "text": "النَّظَرِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "تَحْصُلُ عَلَى العَسَلِ مِن .............",
        "options": [
            {"label": "أ", "text": "الدَّوْدَةِ", "value": "أ"},
            {"label": "ب", "text": "الثَّعْلَبِ", "value": "ب"},
            {"label": "ج", "text": "النَّحْلِ", "value": "ج"},
            {"label": "د", "text": "النَّقْلِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "الزَّرَافَةُ ............. حَيَوَانٌ لَهُ عُنُقٌ طَوِيلٌ جِدًّا.",
        "options": [
            {"label": "أ", "text": "الأُرْزَةُ", "value": "أ"},
            {"label": "ب", "text": "الحِصَانُ", "value": "ب"},
            {"label": "ج", "text": "الْقِطَارُ", "value": "ج"},
            {"label": "د", "text": "الخُرُوفُ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "تَذْهَبُ إِلَى ............. لِتَتَعَلَّمَ.",
        "options": [
            {"label": "أ", "text": "المَخْبَزِ", "value": "أ"},
            {"label": "ب", "text": "الجِبَالِ", "value": "ب"},
            {"label": "ج", "text": "المَدْرَسَةِ", "value": "ج"},
            {"label": "د", "text": "المَكْتَبَةِ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "اللِّبْدُ جُزْءٌ أَحَدِ أَعْضَاءِ .............",
        "options": [
            {"label": "أ", "text": "التَّنَاوُلِ", "value": "أ"},
            {"label": "ب", "text": "الجِسْمِ", "value": "ب"},
            {"label": "ج", "text": "القَرْبِ", "value": "ج"},
            {"label": "د", "text": "الفَرِيقِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "الجِمَالُ ............. حَيَوَانٌ صَحْرَاوِيٌّ.",
        "options": [
            {"label": "أ", "text": "الجِمَالُ", "value": "أ"},
            {"label": "ب", "text": "القِطَارُ", "value": "ب"},
            {"label": "ج", "text": "الطَّرِيقُ", "value": "ج"},
            {"label": "د", "text": "الذِّئْبُ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "تَرْتَفِعُ حَرَارَةُ الطَّقْسِ فِي فَصْلِ .............",
        "options": [
            {"label": "أ", "text": "الخَرِيفِ", "value": "أ"},
            {"label": "ب", "text": "الشِّتَاءِ", "value": "ب"},
            {"label": "ج", "text": "الرَّبِيعِ", "value": "ج"},
            {"label": "د", "text": "الصَّيْفِ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "الخَرِيطَةُ ............. تُخَطِّطُ المَلامِسِ.",
        "options": [
            {"label": "أ", "text": "الخُطَّاطِ", "value": "أ"},
            {"label": "ب", "text": "الخَيَّاطِ", "value": "ب"},
            {"label": "ج", "text": "الخُطُوطِ", "value": "ج"},
            {"label": "د", "text": "المَزَارِعِ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "يَحْكِي ............. عَلَى المَنَاصِبِ.",
        "options": [
            {"label": "أ", "text": "السَّائِقُ", "value": "أ"},
            {"label": "ب", "text": "الشَّارِحُ", "value": "ب"},
            {"label": "ج", "text": "الخَطِيبُ", "value": "ج"},
            {"label": "د", "text": "رَجُلُ الأَعْمَالِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "يَبْنِي ............. غُرْفَةً فَوْقَ الشَّجَرَةِ.",
        "options": [
            {"label": "أ", "text": "النَّقَّاشُ", "value": "أ"},
            {"label": "ب", "text": "النَّجَّارُ", "value": "ب"},
            {"label": "ج", "text": "المُعَلِّمُ", "value": "ج"},
            {"label": "د", "text": "الطَّبِيبُ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "أَرَى الصُّوَرَ بِوَاسِطَةِ .............",
        "options": [
            {"label": "أ", "text": "عَيْنِي", "value": "أ"},
            {"label": "ب", "text": "يَدِي", "value": "ب"},
            {"label": "ج", "text": "رَأْسِي", "value": "ج"},
            {"label": "د", "text": "أُذُنِي", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "مَاءُ البَحْرِ طَعْمُهُ .............",
        "options": [
            {"label": "أ", "text": "عَذْبٌ", "value": "أ"},
            {"label": "ب", "text": "حَامِضٌ", "value": "ب"},
            {"label": "ج", "text": "مَالِحٌ", "value": "ج"},
            {"label": "د", "text": "مُرٌّ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "............ مِنَ الصِّفَاتِ الحَمِيدَةِ.",
        "options": [
            {"label": "أ", "text": "البُخْلُ", "value": "أ"},
            {"label": "ب", "text": "الكَذِبُ", "value": "ب"},
            {"label": "ج", "text": "الأَمَانَةُ", "value": "ج"},
            {"label": "د", "text": "الطَّمَاعَةُ", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "نَسْتَقِلُّ ............. لِلسَّفَرِ فِي البَحْرِ.",
        "options": [
            {"label": "أ", "text": "القِطَارَ", "value": "أ"},
            {"label": "ب", "text": "السَّفِينَةَ", "value": "ب"},
            {"label": "ج", "text": "السَّيَّارَةَ", "value": "ج"},
            {"label": "د", "text": "الدَّرَاجَةَ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "............ مِنَ المَعَادِنِ.",
        "options": [
            {"label": "أ", "text": "البِلاَسْتِيكُ", "value": "أ"},
            {"label": "ب", "text": "الحَدِيدُ", "value": "ب"},
            {"label": "ج", "text": "الزُّجَاجُ", "value": "ج"},
            {"label": "د", "text": "الخَشَبُ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "القَارَّةُ أَكْبَرُ مِنْ .............",
        "options": [
            {"label": "أ", "text": "القَارَةِ", "value": "أ"},
            {"label": "ب", "text": "العَالِمِ", "value": "ب"},
            {"label": "ج", "text": "القَرْيَةِ", "value": "ج"},
            {"label": "د", "text": "المُحِيطِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "مَنْظَرَةٌ بِكَثْرَةٍ هِيَ الصَّحْرَاءُ.",
        "options": [
            {"label": "أ", "text": "الرِّمَال", "value": "أ"},
            {"label": "ب", "text": "المِيَاه", "value": "ب"},
            {"label": "ج", "text": "الغَابَات", "value": "ج"},
            {"label": "د", "text": "البُرْكَان", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "الشَّجَرَةُ .............",
        "options": [
            {"label": "أ", "text": "كِتَابٌ", "value": "أ"},
            {"label": "ب", "text": "حَيَوَانٌ", "value": "ب"},
            {"label": "ج", "text": "نَبَاتٌ", "value": "ج"},
            {"label": "د", "text": "جَمَادٌ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "يَصْنَعُ الخَبِيزُ مِنْ .............",
        "options": [
            {"label": "أ", "text": "الفَصْل", "value": "أ"},
            {"label": "ب", "text": "الطَّبِيب", "value": "ب"},
            {"label": "ج", "text": "الدَّقِيق", "value": "ج"},
            {"label": "د", "text": "الحَلِيب", "value": "د"},
        ],
        "correct": "د"
    },
    {
        "text": "الأُمُ تَحْمِلُ طِفْلَهَا.",
        "options": [
            {"label": "أ", "text": "قَوِيٌّ", "value": "أ"},
            {"label": "ب", "text": "كَبِيرٌ", "value": "ب"},
            {"label": "ج", "text": "ضَعِيفٌ", "value": "ج"},
            {"label": "د", "text": "كُرَةٌ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "نَضَعُ أَمْوَالَنَا فِي .............",
        "options": [
            {"label": "أ", "text": "السُّوقِ", "value": "أ"},
            {"label": "ب", "text": "المَدْرَسَةِ", "value": "ب"},
            {"label": "ج", "text": "البَنْكِ", "value": "ج"},
            {"label": "د", "text": "المَخْبَزِ", "value": "د"},
        ],
        "correct": "ج"
    },
    {
        "text": "نَسْمَعُ الإِذَاعَةَ عَنْ طَرِيقِ .............",
        "options": [
            {"label": "أ", "text": "السِّينَمَا", "value": "أ"},
            {"label": "ب", "text": "الرَّادِيُو", "value": "ب"},
            {"label": "ج", "text": "الكِتَابِ", "value": "ج"},
            {"label": "د", "text": "الصَّحِيفَةِ", "value": "د"},
        ],
        "correct": "ب"
    },
    {
        "text": "المَرْحَلَةُ الاِبْتِدَائِيَّةُ تَأْتِي بَعْدَ .............",
        "options": [
            {"label": "أ", "text": "الرَّوضَةِ", "value": "أ"},
            {"label": "ب", "text": "المُتَوَسِّطَةِ", "value": "ب"},
            {"label": "ج", "text": "الثَّانَوِيَّةِ", "value": "ج"},
            {"label": "د", "text": "الْجَامِعَةِ", "value": "د"},
        ],
        "correct": "أ"
    },
    {
        "text": "الكُوَيْتُ وَالسُّعُودِيَّةُ وَالبَحْرَيْنُ دُوَلٌ .............",
        "options": [
            {"label": "أ", "text": "أَمْرِيكِيَّةٌ", "value": "أ"},
            {"label": "ب", "text": "خَلِيجِيَّةٌ", "value": "ب"},
            {"label": "ج", "text": "أُورُوبِيَّةٌ", "value": "ج"},
            {"label": "د", "text": "أَفْرِيقِيَّةٌ", "value": "د"},
        ],
        "correct": "ب"
    },













]
